Repository: HIRL-Squad/ProMind
Catalog: ProMind/Localization/*.lproj/Localizable.strings
Languages: ms

source: This is part of your memory and concentration task.
ms: Ini adalah sebahagian dari latihan memori dan konsentrasi anda.

source: You will hear some numbers.
ms: Anda akan mendengar beberapa numbor.

source: Once done, you will hear a bell, like so:
ms: Kemudian, anda akan dengar bunyi loceng seperti ini:

source: (Bell Sound)
ms: (Bunyi Loceng)

source: When you hear the bell, repeat the numbers in the same order.
ms: Apabila anda dengar bunyi loceng, ulang nombor-nomborya dalam urutan yang sama.

source: For example, if you hear:
ms: Contohnya, sekiranya anda dengar:

source: You would say:
ms: Anda perlu ulang:

source: If you hear:
ms: Kalau anda dengar:

source: What would you say?
ms: cuba ulang nombor-nombornya?

source: That is incorrect, you would say:
ms: Salah, anda harus ulang:

source: Good job, now let’s do the actual test.
ms: Baik, sekarang, ayuh kita lakukan ujian pertama.

source: Ready?
ms: Sedia?

source: Go!
ms: Mula!

source: Now, let’s move on to the second task.
ms: Sekarang, ayuh kita buat latihan kedua.

source: This time, you will have to repeat the numbers backwards.
ms: Kali ini, anda harus ulang nombor-nombornya dari belakang.

source: you would say:
ms: Anda perlu ulang:

source: Good job, now let's do the actual test.
ms: Baik, sekarang, ayuh kita lakukan ujian pertama.

source: Congratulations. You have completed the Digit Span Test. Please refer to your results on the screen.
ms: Tahniah. Anda telah menyelesaikan Ujian Span Digit. Sila rujuk keputusan anda pada skrin.

source: Reminder
ms: Peringatan

source: Please speak as slow as only one digit per second! Click Reset Answer button again, and wait for AT LEAST one second if the voice cannot be recognized! In addition, please try to speak at least three digits before clicking Reset Answer button!
ms: Sila bercakap perlahan seperti hanya satu digit sesaat! Klik butang Tetapkan Semula Jawapan sekali lagi, dan tunggu SEKURANG-KURANGNYA satu saat jika suara tidak dapat dikenali! Selain itu, sila cuba bercakap sekurang-kurangnya tiga digit sebelum mengklik Tetapkan semula butang Jawapan!

source: An error occured
ms: Ralat berlaku

source: Open Settings
ms: Buka Tetapan

source: Close
ms: Tutup

source: For resetting your recorded numbers
ms: Untuk menetapkan semula nombor yang direkodkan

source: For submitting your recorded numbers
ms: Untuk menghantar nombor yang direkodkan

source: Look at the circles below.
ms: Lihat bulatan di bawah.

source: The circles have numbers in them.
ms: Ada nombor di dalamnya.

source: Begin at number 1,
ms: Mula dari nombor 1,

source: draw a line in ascending order from 1 to 2,
ms: Dalam susunan menaik, lukiskan garisan dari 1 hingga ke 2,

source: 2 to 3,
ms: 2 hingga ke 3,

source: 3 to 4,
ms: 3 hingga 4,

source: and so on, until you reach the end.
ms: dan selanjutnya, sehingga anda sampai ke bulatan terakhir.

source: Draw the lines as fast as you can.
ms: Cuba lukis garisan dengan secepat mungkin.

source: Do not lift the pencil from the iPad.
ms: Jangan angkat pensil dari iPad.

source: Begin!
ms: Mula!

source: Good job! Now let's do the actual test!
ms: Baik! ayuh kita lakukan ujiannya!

source: On this page there are both numbers and letters.
ms: Pada halaman ini terdapat kedua-dua nombor dan huruf.

source: Do this in the same way.
ms: Lakukan ini dengan cara yang sama.

source: draw a line from 1 to A,
ms: lukis garis dari 1 hingga A,

source: A to 2,
ms: A hingga ke 2,

source: 2 to B,
ms: 3 hingga 4,

source: That is not the correct move!
ms: Itu bukan langkah yang betul!

source: You should connect 4 to 5.
ms: Anda harus menyambung 4 hingga 5.

source: You should connect 5 to 6.
ms: Anda harus menyambung 5 hingga 6.

source: You should connect 6 to 7.
ms: Anda harus menyambung 6 hingga 7.

source: You should connect 7 to 8.
ms: Anda harus menyambung 7 hingga 8.

source: You should connect 8 to 9.
ms: Anda harus menyambung 8 hingga 9.

source: You should connect 9 to 10.
ms: Anda harus menyambung 9 hingga 10.

source: You should connect B to 3.
ms: Anda harus menyambung B hingga 3.

source: You should connect 3 to C.
ms: Anda harus menyambung 3 hingga C.

source: You should connect C to 4.
ms: Anda harus menyambung C hingga 4.

source: You should connect 4 to D.
ms: Anda harus menyambung 4 hingga D.

source: You should connect D to 5.
ms: Anda harus menyambung D hingga 5.

source: You should connect 5 to E.
ms: Anda harus menyambung 5 hingga E.

source: That is not the correct move! You should connect 4 to 5.
ms: Itu bukan langkah yang betul! Anda harus menyambung 4 hingga 5.

source: That is not the correct move! You should connect 5 to 6.
ms: Itu bukan langkah yang betul! Anda harus menyambung 5 hingga 6.

source: That is not the correct move! You should connect 6 to 7.
ms: Itu bukan langkah yang betul! Anda harus menyambung 6 hingga 7.

source: That is not the correct move! You should connect 7 to 8.
ms: Itu bukan langkah yang betul! Anda harus menyambung 7 hingga 8.

source: That is not the correct move! You should connect 8 to 9.
ms: Itu bukan langkah yang betul! Anda harus menyambung 8 hingga 9.

source: That is not the correct move! You should connect 9 to 10.
ms: Itu bukan langkah yang betul! Anda harus menyambung 9 hingga 10.

source: That is not the correct move! You should connect B to 3.
ms: Itu bukan langkah yang betul! Anda harus menyambung B hingga 3.

source: That is not the correct move! You should connect 3 to C.
ms: Itu bukan langkah yang betul! Anda harus menyambung 3 hingga C.

source: That is not the correct move! You should connect C to 4.
ms: Itu bukan langkah yang betul! Anda harus menyambung C hingga 4.

source: That is not the correct move! You should connect 4 to D.
ms: Itu bukan langkah yang betul! Anda harus menyambung 4 hingga D.

source: That is not the correct move! You should connect D to 5.
ms: Itu bukan langkah yang betul! Anda harus menyambung D hingga 5.

source: That is not the correct move! You should connect 5 to E.
ms: Itu bukan langkah yang betul! Anda harus menyambung 5 hingga E.

source: There are a total of 15 circles.
ms: Terdapat 15 bulatan.

source: Please connect them without lifting the stylus as much as possible.
ms: Sila sambungkannya tanpa mengangkat stylus sebanyak mungkin.

source: You have 180 seconds.
ms: Anda mempunyai 180 saat.

source: There are a total of 15 circles. Please connect them without lifting the stylus as much as possible. You have 180 seconds.
ms: Terdapat 15 bulatan. Sila sambungkannya tanpa mengangkat stylus sebanyak mungkin. Anda mempunyai 180 saat.

source: Congratulations. You have completed the Trail Making Test. Please refer to your results on the screen.
ms: Tahniah. Anda telah menyelesaikan Ujian Membuat Jejak. Sila rujuk keputusan anda pada skrin.

source: ATTENTION
ms: PERHATIAN

source: Please do NOT lift Apple Pencil from the screen!
ms: Sila JANGAN angkat Pensil Apple dari skrin!

source: OK
ms: Okey

source: Please do not lift up pencil too many times during the test!
ms: Tolong jangan angkat pensel terlalu banyak kali semasa ujian!

source: Too Many Lifts
ms: Terlalu Banyak Lif
